{
  "leadingdev": {
    "image": "img/leadingdev.webp",
    "name": "LeadingDev",
    "position": "Fullstack Developer",
    "time": "2020,2023",
    "dateStart": "Oct. 2022",
    "dateEnd": "Current",
    "description": "At LeadingDev, I have experienced significant professional growth, engaging in innovative and challenging projects. My responsibilities encompass developing end-to-end solutions, ranging from interface design to backend implementation, with a constant focus on continuous improvement and embracing new technologies. I have closely collaborated with multidisciplinary teams to deliver products that not only meet but exceed our clients' expectations.",
    "technologies": [
      "React",
      "Ruby",
      "Ruby on Rails",
      "CoffeeScript",
      "Sass",
      "MySQL",
      "PostgreSQL",
      "Bootstrap"
    ],
    "projects": [
      {
        "name": "SkadeIoT",
        "description": "Skade is an integrated system for the management and monitoring of winter road conditions on highways and roads. It includes fleet management via GPS, real-time analysis of weather conditions, tracking of stations and irrigation systems, and an advanced permission system for users. Its focus is on efficiency and safety in road infrastructure during the winter."
      },
      {
        "name": "Soter4",
        "description": "The company specializes in consulting and technological innovation in global security, providing advanced and customized solutions in cybersecurity and physical security to protect organizations in an interconnected digital environment."
      },
      {
        "name": "Magnet",
        "client": "Avallain",
        "description": "Magnet is a comprehensive learning platform by Avallain that provides robust management tools for learning content, products, and users. It features an intuitive interface with advanced features that work in conjunction with Avallain Author, a leading e-learning authoring tool. Content can be hosted, managed, and reused flexibly, with the capability for immediate publication on the Magnet platform."
      },
      {
        "name": "Richmond Learning Platform",
        "client": "Avallain",
        "description": "The Richmond Learning Platform is a digital education platform enhanced by Avallain Author and Avallain Unity. It aims to make learning more accessible and affordable for Latin American students, particularly during the global health crisis. The platform concentrates on enhancing English language proficiency, providing high-quality, cost-effective materials, and allowing students to pursue their education remotely during quarantine."
      }
    ]
  },
  "domestika": {
    "image": "img/domestika.webp",
    "name": "Domestika",
    "position": "Frontend Developer",
    "time": "2022-2022",
    "dateStart": "May. 2022",
    "dateEnd": "Jun. 2022",
    "description": "Description of the course taught.",
    "technologies": ["React", "Sass", "Scrum"],
    "projects": [
      {
        "name": "Domestika",
        "description": "Domestika is an online platform for creative learning, offering a variety of courses taught by experts. It started as a forum in Spain and now is based in San Francisco, standing out for its focus on creative areas such as software, crafts, and illustration."
      }
    ]
  },
  "pureibizaradio": {
    "image": "img/ibizaradio.webp",
    "name": "Pure Ibiza Radio",
    "position": "Frontend Developer - Freelance",
    "time": "2022-2022",
    "dateStart": "Apr. 2022",
    "dateEnd": "May. 2022",
    "description": "It was my first job as a Developer, which posed a great challenge since I had never worked with React Native before. Despite this, I decided to tackle the project with determination. The experience ended successfully: the app was published on the App Store.",
    "technologies": ["React native"],
    "projects": [
      {
        "name": "Pure Ibiza Radio",
        "description": "Pure Ibiza Radio is a station focused on electronic music and the islands of Ibiza and Formentera. With over 25 years in the electronic scene, it aims to connect listeners with music, blending established figures and emerging talents to maintain its essence and continuous evolution."
      }
    ]
  }
}
